package LeanJDK10;

/**
 * jdk 10
 */
public class Features1 {

    /**
     *      1、 局部变量类型推导   使用var
     *      JDK10 可以使用var作为局部变量类型推断标识符，此符号仅适用于局部变量，增强for循环的索引，
     *      以及传统for循环的本地变量；它不能使用于方法形式参数，构造函数形式参数，方法返回类型，字段，
     *      catch形式参数或任何其他类型的变量声明。
     *      标识符var不是关键字；相反，它是一个保留的类型名称。这意味着var用作变量，方法名或则包名称的代码不会受到影响；
     *      但var不能作为类或则接口的名字（但这样命名是比较罕见的，因为他违反了通常的命名约定，类和接口首字母应该大写）。
     *
     *
     *      2、将JDK多存储库合并为单存储库
     *      为了简化和简化开发，将JDK多存储库合并到一个存储库中。多年来，JDK的完整代码已经被分解成多个存储库。
     *      在JDK9 中有八个仓库：root、corba、hotspot、jaxp、jaxws、jdk、langtools和nashorn。在JDK10中被合并为一个存储库。
     *
     *
     */


}
